In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
dataset = pd.read_csv('new_dataset.csv')
X = dataset.iloc[:, :-1].values
y = dataset.iloc[:, -1].values

In [5]:
dataset

,age,workclass,education_num,marital_status,occupation,relationship,race,sex,hours_per_week,native_country,salary
0,39,State-gov,13,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,50,Self-emp-not-inc,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,38,Private,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,53,Private,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,28,Private,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...
30157,27,Private,12,Married-civ-spouse,Tech-support,Wife,White,Female,38,United-States,<=50K
30158,40,Private,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,40,United-States,>50K
30159,58,Private,9,Widowed,Adm-clerical,Unmarried,White,Female,40,United-States,<=50K
30160,22,Private,9,Never-married,Adm-clerical,Own-child,White,Male,20,United-States,<=50K
30161,52,Self-emp-inc,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,40,United-States,>50K

In [3]:
X

array([[39, ' State-gov', 13, ..., ' Male', 40, ' United-States'],
       [50, ' Self-emp-not-inc', 13, ..., ' Male', 13, ' United-States'],
       [38, ' Private', 9, ..., ' Male', 40, ' United-States'],
       ...,
       [58, ' Private', 9, ..., ' Female', 40, ' United-States'],
       [22, ' Private', 9, ..., ' Male', 20, ' United-States'],
       [52, ' Self-emp-inc', 9, ..., ' Female', 40, ' United-States']],
      dtype=object)

In [5]:
y

array([' <=50K', ' <=50K', ' <=50K', ..., ' <=50K', ' <=50K', ' >50K'],
      dtype=object)

In [11]:
 from sklearn.compose import ColumnTransformer
 from sklearn.preprocessing import OneHotEncoder
 ct = ColumnTransformer(transformers=[('encoder', OneHotEncoder(), [1,3,4,5,6,7,9])], remainder='passthrough')
 X = np.array(ct.fit_transform(X))

In [13]:
X

array([[1.0, 0.0, 1.0, ..., ' Male', 40, ' United-States'],
       [1.0, 0.0, 1.0, ..., ' Male', 13, ' United-States'],
       [1.0, 0.0, 1.0, ..., ' Male', 40, ' United-States'],
       ...,
       [1.0, 0.0, 1.0, ..., ' Female', 40, ' United-States'],
       [1.0, 0.0, 1.0, ..., ' Male', 20, ' United-States'],
       [1.0, 0.0, 0.0, ..., ' Female', 40, ' United-States']],
      dtype=object)

,age,education_num,hours_per_week,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,workclass_ Self-emp-not-inc,workclass_ State-gov,workclass_ Without-pay,...,native_country_ Scotland,native_country_ South,native_country_ Taiwan,native_country_ Thailand,native_country_ Trinadad&Tobago,native_country_ United-States,native_country_ Vietnam,native_country_ Yugoslavia,salary_ <=50K,salary_ >50K
0,39,13,40,0,0,0,0,0,1,0,...,0,0,0,0,0,1,0,0,1,0
1,50,13,13,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,1,0
2,38,9,40,0,0,1,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
3,53,7,40,0,0,1,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
4,28,13,40,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30157,27,12,38,0,0,1,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
30158,40,9,40,0,0,1,0,0,0,0,...,0,0,0,0,0,1,0,0,0,1
30159,58,9,40,0,0,1,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
30160,22,9,20,0,0,1,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
30161,52,9,40,0,0,0,1,0,0,0,...,0,0,0,0,0,1,0,0,0,1